DataProcessors/Установитьрегион89.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>Установитьрегион89</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Регионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Регионы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяннойПояс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинонимФСПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Установитьрегион89/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Старт(Команда)
	// Вставить содержимое обработчика.
	
	Поменять();
	
	Сообщить("Ок"); 
КонецПроцедуры



&НаСервере
Процедура Поменять()

	//Ямало-Ненецкий   89
	
	 //НомОбъект = НоменклатураСсылка.ПолучитьОбъект();
	 //НомОбъект.Состав.Цена = Цена;
	 //НомОбъект.Записать(); 
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Регионы.Ссылка КАК Ссылка,
		|	Регионы.Наименование КАК Наименование,
		|	Регионы.КодРегионаФССП КАК КодРегионаФССП
		|ИЗ
		|	Справочник.Регионы КАК Регионы
		|ГДЕ
		|	Регионы.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","%Ямало-Ненецкий%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		   НомОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		   НомОбъект.КодРегионаФССП="89"; 
		   НомОбъект.СинонимФСПП="Ямало-Ненецкий";
		   
		   НомОбъект.Записать();
		   
		   
		   
		
	КонецЦикла;
	
	

	 
	 
	 

КонецПроцедуры
